# DataFrames Part 1

In [38]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [37]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df.shape

(5, 4)

In [8]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [9]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [10]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

# Dataframes Part 2

In [11]:
booldf = df > 0

In [12]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [13]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [22]:
resultdf = df[df['W']<0]

In [23]:
resultdf['X']

C    0.740122
Name: X, dtype: float64

In [24]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [27]:
boolser = df['W'] > 0
result = df[boolser]

In [28]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
newind = 'CA NY WY OR CO'.split()

In [33]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [34]:
df['States'] = newind

In [35]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [36]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# DataFrames Part 3

In [40]:
# index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [41]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [42]:
inside

[1, 2, 3, 1, 2, 3]

In [43]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [47]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [48]:
df

             A         B
G1 1 -0.116773  1.901755
   2  0.238127  1.996652
   3 -0.993263  0.196800
G2 1 -1.136645  0.000366
   2  1.025984 -0.156598
   3 -0.031579  0.649826

In [49]:
df.loc['G1']

          A         B
1 -0.116773  1.901755
2  0.238127  1.996652
3 -0.993263  0.196800

In [50]:
df.index.names = ['Groups','Num']

In [51]:
df

                   A         B
Groups Num
G1     1   -0.116773  1.901755
       2    0.238127  1.996652
       3   -0.993263  0.196800
G2     1   -1.136645  0.000366
       2    1.025984 -0.156598
       3   -0.031579  0.649826

In [52]:
df.loc['G2'].loc[2]['B']

-0.1565979042889875

In [53]:
df.loc['G1'].loc[2]['A']

0.23812695876901832

In [55]:
df.xs('G1')

            A         B
Num
1   -0.116773  1.901755
2    0.238127  1.996652
3   -0.993263  0.196800

In [56]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.116773  1.901755
G2     -1.136645  0.000366